src/test/resources/payload/consultarPrincipalidade.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prin="http://sicredi.com.br/crm/ws/v1/principalidade">
    <soapenv:Header/>
    <soapenv:Body>
        <prin:consultarPrincipalidade>
            <prin:InConsultarPrincipalidade>
                <prin:numDocumento>#(numDocumento)</prin:numDocumento>
                <prin:codCooperativa>#(codCooperativa)</prin:codCooperativa>
                <prin:numPeriodo>#(numPeriodo)</prin:numPeriodo>
            </prin:InConsultarPrincipalidade>
        </prin:consultarPrincipalidade>
    </soapenv:Body>
</soapenv:Envelope>